code/DataProcessors/ЛичныйКабинет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ЛичныйКабинет</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

code/Catalogs/Сотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сотрудник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code/DataProcessors/ЛичныйКабинет/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Показать(Команда)
	Элементы.Показать.Видимость = Ложь;
    Элементы.Скрыть.Видимость = Истина;
    Элементы.Пароль.РежимПароля = "Нет";
КонецПроцедуры

&НаКлиенте
Процедура Скрыть(Команда)
	Элементы.Показать.Видимость = Истина;
    Элементы.Скрыть.Видимость = Ложь;
    Элементы.Пароль.РежимПароля = "Да";
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	ДанныйСотрудник = Справочники.Сотрудник.НайтиПоНаименованию(ФИО);
	ИзменитьСотрудник = ДанныйСотрудник.ПолучитьОбъект();
	ИзменитьСотрудник.НомерТелефона=Телефон;
	ИзменитьСотрудник.Email=Email;
	ИзменитьСотрудник.Пароль=Пароль; 
	ИзменитьСотрудник.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	//ФИО = ПользователиИнформационнойБазы.ТекущийПользователь(); 
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!      
	Логин = Пользователь.Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудник.Наименование КАК Наименование,
		|	Сотрудник.Должность КАК Должность,
		|	Сотрудник.НомерТелефона КАК НомерТелефона,
		|	Сотрудник.Пароль КАК Пароль,
		|	Сотрудник.Email КАК Email
		|ИЗ
		|	Справочник.Сотрудник КАК Сотрудник
		|ГДЕ
		|	Сотрудник.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи  
		ФИО = ВыборкаДетальныеЗаписи.Наименование;
		Должность = ВыборкаДетальныеЗаписи.Должность;
		Телефон = ВыборкаДетальныеЗаписи.НомерТелефона;
		EMail = ВыборкаДетальныеЗаписи.EMail;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА




КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
